app/Controllers/Home.php

    public function index(): string
    {
        $produtomodel = new ProdutoModel();
        $produtos = $produtomodel->findAll();
---
SELECT *
FROM `produtos`

    public function excluirProduto($id){

        $produtomodel = new ProdutoModel();
        $produtomodel->delete($id);
---
DELETE FROM `produtos`
WHERE `id` IN ('23')