app/Controllers/Produtos.php

    public function salvar()
    {
        $produtoModel = new ProdutoModel();
        $data = [
            'nome'  => $this->request->getPost('nome'),
            'preco' => $this->request->getPost('preco'),
            'quantidade' => $this->request->getPost('quantidade'),
        ];
<<<<<<< HEAD
        $produtoModel->insert($data);
---
INSERT INTO `produtos` (`nome`, `preco`, `quantidade`) VALUES ('pol', '12', '12')